read_verilog cpu.v alu.v control.v immgen.v mask_n_shift.v regfile.v
synth_xilinx -top cpu
write_verilog cpu_synth.v
